# Akses Localhost dengan Python

## Koneksi MySQL dan Python

In [ ]:
# import module 
import mysql.connector

# koneksi server
db1 = mysql.connector.connect(
  host='localhost',
  user='bakti',
  passwd='123'
)

## Memeriksa Daftar Database

In [ ]:
# membuat objek 'cursor` sebagai kata kunci eksekusi SQL
cursor1 = db1.cursor()

# Perintah SQL
sql = 'SHOW DATABASES'

# Eksekusi perintah  SQL
cursor1.execute(sql)

# menampilkan daftar database
for data in cursor1:
  print(data)

('information_schema',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('test',)

## Membuat Database Baru

In [ ]:
sql= 'CREATE DATABASE jne2'
cursor1.execute(sql)

## Menghapus Database

In [ ]:
sql= 'DROP DATABASE jne2'
cursor1.execute(sql)

## Memeriksa Tabel Dari Database

In [ ]:
# import module 
import mysql.connector

# koneksi salah satu database MySQl ke Python
db2 = mysql.connector.connect(
  host='localhost',
  user='bakti',
  passwd='123',
  database='jne2'
)

# membuat objek 'cursor` sebagai kata kunci eksekusi SQL
cursor2 = db2.cursor()

# Perintah SQL
sql = "SHOW TABLES"

# Eksekusi perintah  SQL
cursor2.execute(sql)

# menampilkan daftar tabel
for x in cursor2:
  print(x)

# CRUD Lanjut

In [5]:
import pandas as pd

# read data CSV
link1 = 'https://raw.githubusercontent.com/dsciencelabs/JNE_Data_Analytics_PySQL/main/data/data_latihan/users.csv'
link2 = 'https://raw.githubusercontent.com/dsciencelabs/JNE_Data_Analytics_PySQL/main/data/data_latihan/products.csv'
link3 = 'https://raw.githubusercontent.com/dsciencelabs/JNE_Data_Analytics_PySQL/main/data/data_latihan/orders.csv'
link4 = 'https://raw.githubusercontent.com/dsciencelabs/JNE_Data_Analytics_PySQL/main/data/data_latihan/order_items.csv'
link5 = 'https://raw.githubusercontent.com/dsciencelabs/JNE_Data_Analytics_PySQL/main/data/data_latihan/inventory_items.csv'
link6 = 'https://raw.githubusercontent.com/dsciencelabs/JNE_Data_Analytics_PySQL/main/data/data_latihan/events.csv'
link7 = 'https://raw.githubusercontent.com/dsciencelabs/JNE_Data_Analytics_PySQL/main/data/data_latihan/distribution_centers.csv'

df1 = pd.read_csv(link1, sep=';' )
df2 = pd.read_csv(link2, sep=';' )
df3 = pd.read_csv(link3, sep=';' )
cols= df3.columns[4:7]
df3[cols] = df3[cols].apply(pd.to_datetime)

df4 = pd.read_csv(link4, sep=';' )
df5 = pd.read_csv(link5, sep=';' )
df6 = pd.read_csv(link6, sep=';' )
df7 = pd.read_csv(link7, sep=';' )

,order_id,user_id,status,gender,created_at,returned_at,shipped_at,delivered_at,num_of_item
0,21,17,Shipped,F,2023-05-30 12:56:00,NaT,2023-06-01 00:00:00,NaN,"1,00"
1,24,18,Shipped,F,2022-08-02 00:00:00,NaT,2022-08-03 00:00:00,NaN,"1,00"
2,26,19,Shipped,F,2023-02-12 00:00:00,NaT,2023-02-13 12:59:00,NaN,"1,00"
3,33,22,Shipped,F,2021-03-03 00:00:00,NaT,2021-03-03 00:00:00,NaN,"1,00"
4,34,23,Shipped,F,2023-02-14 17:47:00,NaT,2023-02-14 18:20:00,NaN,"1,00"

## Create Tabel dari CSV

In [11]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\user\anaconda3\lib\site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [12]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\user\anaconda3\lib\site-packages (2.0.16)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pymysql
from sqlalchemy import create_engine

# membuat engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="bakti",
                               pw="123",
                               db="jne2"))

# df1.to_sql('users', engine, if_exists = 'replace', index = True)
df1.to_sql('users', engine, if_exists='append', index = False)
df2.to_sql('products', engine, if_exists='append', index = False)
df3.to_sql('orders', engine, if_exists='append', index = False)
df4.to_sql('order_items', engine, if_exists='append', index = False)
df5.to_sql('inventory_items', engine, if_exists='append', index = False)
df6.to_sql('events', engine, if_exists='append', index = False)
df7.to_sql('distribution_centers', engine, if_exists='append', index = False)

10

## Read Dataframe

In [14]:
# engine koneksi ke database
db_enco = engine.connect()

read1 = pd.read_sql('distribution_centers', db_enco)
read1

   id                                         name latitude longitude
0   1                                   Memphis TN    35,12    -89,97
1   2                                   Chicago IL    41,84    -87,68
2   3                                   Houston TX    29,76    -95,37
3   4                               Los Angeles CA    34,05   -118,25
4   5                               New Orleans LA    29,95    -90,07
5   6  Port Authority of New York/New Jersey NY/NJ    40,63    -73,78
6   7                              Philadelphia PA    39,95    -75,17
7   8                                    Mobile AL    30,69    -88,04
8   9                                Charleston SC    32,78    -79,93
9  10                                  Savannah GA    32,02    -81,12

## Update Data

In [68]:
sql = 'UPDATE distribution_centers SET name=%s, latitude=%s, longitude=%s WHERE id=%s'
val = ("JNE", 106.7977, -6.1774, 10)
cursor2.execute(sql, val)

db2.commit()

pd.read_sql_table('distribution_centers', en_co)

   id                                         name  latitude longitude
0   1                                   Memphis TN   35,1174  -89,9711
1   2                                   Chicago IL   41,8369  -87,6847
2   3                                   Houston TX   29,7604  -95,3698
3   4                               Los Angeles CA     34,05   -118,25
4   5                               New Orleans LA     29,95  -90,0667
5   6  Port Authority of New York/New Jersey NY/NJ    40,634  -73,7834
6   7                              Philadelphia PA     39,95  -75,1667
7   8                                    Mobile AL   30,6944  -88,0431
8   9                                          JNE  106.7977   -6.1774

## Tugas Kelompok

### Tambahkan satu lokasi baru ke dalam tabel

## Delete Data

In [56]:
sql = "DELETE FROM distribution_centers WHERE id=%s"
val = (10, )
cursor2.execute(sql, val)

db2.commit()

print("{} data dihapus".format(cursor2.rowcount))

1 data dihapus

# Mengubah Tabel

## Menambah Kolom

In [69]:
sql = 'ALTER TABLE distribution_centers \
       ADD email VARCHAR(100) \
       FIRST'
cursor2.execute(sql)

db2.commit()

KeyboardInterrupt: